{
  "backend/main.mo": "Motoko canister defining admin bootstrapping and role management, user profile storage, and public contact inquiry handling with AccessControl-based authorization. Includes admin-only endpoints to grant/revoke/list admins and user-facing profile and inquiry logic.",
  "feature_evidence.json": "Feature evidence report documenting two completed frontend features: improved AdminGuard denial messaging showing the user’s Principal, and an admin UI for managing admins. Lists affected files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries of all major frontend files describing routing, layout, auth, admin pages, hooks, utilities, styles, and configuration used across the React app.",
  "frontend/index.css": "Global Tailwind CSS setup defining light and dark theme design tokens with a gritty dirtbike-inspired OKLCH color palette and base element styling.",
  "frontend/index.html": "HTML entry point for the React app setting metadata, page title, and mounting the app at the root div.",
  "frontend/src/App.tsx": "Main React application component configuring TanStack Router routes for public and admin pages, wrapped with theme support and global toaster notifications.",
  "frontend/src/components/auth/AdminGuard.tsx": "Authorization wrapper that enforces admin-only access, handles login and profile setup states, and displays detailed access-denied guidance including the user’s Internet Identity Principal.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button component integrating Internet Identity authentication, showing loading states and clearing React Query cache on logout.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal dialog prompting newly authenticated users to enter and save their display name to complete profile setup.",
  "frontend/src/components/contact/InquirySuccessPanel.tsx": "Reusable success alert component shown after a contact inquiry is successfully submitted.",
  "frontend/src/components/layout/SiteLayout.tsx": "Defines the main site layout with a top navigation, routed content outlet, and a footer containing branding and external attribution links.",
  "frontend/src/components/layout/TopNav.tsx": "Implements a responsive top navigation bar with active link highlighting, desktop and mobile menus, and an integrated login button.",
  "frontend/src/config/youtube.ts": "Centralizes YouTube channel configuration and provides utilities to validate, normalize, and extract a channel handle from URLs or raw input.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches a backend actor based on Internet Identity, handling authenticated vs anonymous access and query invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hooks for managing Internet Identity authentication, including login, logout, status tracking, and persisted identities.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks wrapping backend actor calls for user profiles, admin management, inquiries, and feature-related data.",
  "frontend/src/hooks/useYouTubeChannelVideos.ts": "React Query hook that validates a YouTube channel handle and fetches channel videos with caching, retries, and error handling.",
  "frontend/src/index.css": "Tailwind CSS base stylesheet defining global styles, CSS variables, and light/dark theme color palettes with a gritty dirtbike aesthetic.",
  "frontend/src/lib/bikeVideoFilter.ts": "Utility for filtering YouTube videos to bike-related content using keyword matching with optional allowlist and denylist overrides.",
  "frontend/src/lib/youtube.ts": "Provides a utility function to extract and validate a YouTube video ID from various URL formats or a raw ID string.",
  "frontend/src/lib/youtubeChannelFeed.ts": "Implements utilities to resolve a YouTube channel ID from a handle and fetch/parse the channel’s RSS feed to return structured video metadata without using the YouTube API.",
  "frontend/src/main.tsx": "Bootstraps the React application, setting up React Query and Internet Identity context providers before rendering the root App component.",
  "frontend/src/pages/admin/AdminHomeBoxesPage.tsx": "Admin-only page for editing and saving the two home page feature boxes, loading existing data and persisting updates via backend mutations.",
  "frontend/src/pages/admin/AdminInboxPage.tsx": "Admin-only React page that lists, views, and deletes contact inquiries using query hooks, with loading/error states, sorting by timestamp, and navigation links to other admin tools.",
  "frontend/src/pages/admin/AdminManageAdminsPage.tsx": "Admin-only React page for listing administrators and granting or revoking admin roles by Principal ID, with confirmation dialogs, clipboard copy, and toast notifications.",
  "frontend/src/pages/ContactPage.tsx": "Implements a contact form page with client-side validation, submission via a mutation hook, success feedback, and error handling UI.",
  "frontend/src/pages/HomePage.tsx": "Renders the home page with a hero section and two feature cards, using backend-provided feature box data when available or falling back to defaults.",
  "frontend/src/pages/VideosPage.tsx": "Displays a list of dirtbike-related YouTube videos fetched from a channel feed, handling configuration errors, loading states, filtering, and user-friendly error messages.",
  "frontend/src/utils/urlParams.ts": "Utility module for reading URL parameters from query or hash routing, persisting them in sessionStorage, and clearing sensitive parameters without page reloads.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, content paths, design tokens (colors, radius, fonts, shadows), animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata file describing the current schema/version and a detailed summary of existing frontend and backend features for an Internet Computer full-stack application."
}